In [2]:
#task1
import pandas as pd

!wc -l data/task1/movies.csv
!wc -l data/task1/ratings.csv

9743 data/task1/movies.csv
100837 data/task1/ratings.csv

In [52]:
movies_df = pd.read_csv('data/task1/movies.csv', dtype_backend='numpy_nullable', index_col='movieId', usecols=['movieId', 'title'])
raitings_df = pd.read_csv('data/task1/ratings.csv', dtype_backend='numpy_nullable', usecols=['userId', 'movieId', 'rating'])
movies_df.info()
raitings_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9742 entries, 1 to 193609
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   9742 non-null   string
dtypes: string(1)
memory usage: 161.7 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   userId   100836 non-null  Int64
 1   movieId  100836 non-null  Int64
 2   rating   100836 non-null  Float64
dtypes: Float64(1), Int64(2)
memory usage: 2.6 MB

In [54]:
#movies_df.head()
raitings_df.head()
#raitings_df['timestamp'].is_unique

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [60]:
#target_ratings
trgratings_df = raitings_df[raitings_df['rating'] == 5.0]
trgratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13211 entries, 3 to 100834
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   userId   13211 non-null  Int64
 1   movieId  13211 non-null  Int64
 2   rating   13211 non-null  Float64
dtypes: Float64(1), Int64(2)
memory usage: 451.5 KB

In [67]:
def is_rate_unique(df):
    return df['rating'].is_unique
trgratings_df.groupby(['movieId', 'userId']).apply(is_rate_unique, include_groups=False).all()

True

In [81]:
id_max = trgratings_df.drop(['userId', 'rating'], axis=1)['movieId'].value_counts().idxmax()
movies_df.loc[id_max]

title    Shawshank Redemption, The (1994)
Name: 318, dtype: string

In [89]:
#task2
!wc -l data/task2/power.csv
!wc -l data/task2/transactions.csv

1189483 data/task2/power.csv
0 data/task2/transactions.csv

In [91]:
power_df = pd.read_csv('data/task2/power.csv', dtype_backend='numpy_nullable')
power_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  string
 1   year      1189482 non-null  Int64
 2   quantity  1189482 non-null  Float64
 3   category  1189482 non-null  Int64
dtypes: Float64(1), Int64(2), string(1)
memory usage: 39.7 MB

In [92]:
power_df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [153]:
baltic = ('Estonia', 'Lithuania', 'Latvia')
mask = (power_df['quantity'] >= 0) & (power_df['year'] >= 2005) & (power_df['year'] <= 2010) & power_df['country'].isin(baltic) \
& power_df['category'].isin((4, 12, 21))
power_df[mask]

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10618     Estonia  2007       0.0         4
10619     Estonia  2006       0.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[408 rows x 4 columns]

In [154]:
power_df[mask]['quantity'].sum()

240580.0